{
  "vocab": {
    "!": 0,
    ",": 1,
    ".": 2,
    "?": 3,
    "a": 4,
    "I": 5,
    "the": 6,
    "of": 7,
    "and": 8,
    "to": 9,
    "in": 10,
    "is": 11,
    "it": 12,
    "that": 13,
    "he": 14,
    "she": 15,
    "was": 16,
    "for": 17,
    "on": 18,
    "are": 19,
    "as": 20,
    "with": 21,
    "his": 22,
    "they": 23,
    "at": 24,
    "be": 25,
    "this": 26,
    "have": 27,
    "from": 28,
    "or": 29,
    "by": 30,
    "not": 31,
    "but": 32,
    "we": 33,
    "an": 34,
    "you": 35,
    "my": 36,
    "all": 37,
    "can": 38,
    "her": 39,
    "were": 40,
    "do": 41,
    "has": 42,
    "more": 43,
    "up": 44,
    "will": 45,
    "out": 46,
    "if": 47,
    "so": 48,
    "no": 49,
    "said": 50,
    "what": 51,
    "its": 52,
    "about": 53,
    "into": 54,
    "then": 55,
    "than": 56,
    "time": 57,
    "could": 58,
    "when": 59,
    "who": 60,
    "there": 61,
    "which": 62,
    "would": 63,
    "their": 64,
    "been": 65,
    "one": 66,
    "other": 67,
    "how": 68,
    "had": 69,
    "your": 70,
    "our": 71,
    "some": 72,
    "just": 73,
    "like": 74,
    "only": 75,
    "new": 76,
    "see": 77,
    "get": 78,
    "may": 79,
    "way": 80,
    "after": 81,
    "first": 82,
    "any": 83,
    "also": 84,
    "very": 85,
    "two": 86,
    "now": 87,
    "these": 88,
    "well": 89,
    "people": 90,
    "here": 91,
    "know": 92,
    "year": 93,
    "good": 94,
    "think": 95,
    "day": 96,
    "made": 97,
    "make": 98,
    "over": 99,
    "world": 100,
    "hello": 101,
    "un": 102,
    "break": 103,
    "able": 104,
    "break": 103,
    "able": 104,
    "ing": 105,
    "ed": 106,
    "er": 107,
    "est": 108,
    "ly": 109,
    "tion": 110,
    "ness": 111,
    "ment": 112,
    "ful": 113,
    "less": 114,
    "ous": 115,
    "ive": 116,
    "al": 117,
    "ical": 118,
    "anti": 119,
    "dis": 120,
    "establish": 121,
    "ment": 112,
    "arian": 122,
    "ism": 123,
    "Edin": 124,
    "burgh": 125,
    "Ed": 126,
    "in": 10,
    "Chat": 127,
    "GP": 128,
    "T": 129,
    "GPT": 130,
    "quick": 131,
    "brown": 132,
    "fox": 133,
    "def": 134,
    "fib": 135,
    "on": 136,
    "acci": 137,
    "nacci": 138,
    "fib": 135,
    "fibonacci": 139,
    "n": 140,
    "cat": 141,
    "dog": 142,
    "fish": 143,
    "bird": 144,
    "horse": 145,
    "water": 146,
    "light": 147,
    "dark": 148,
    "night": 149,
    "morning": 150,
    "evening": 151,
    "school": 152,
    "student": 153,
    "teacher": 154,
    "learn": 155,
    "class": 156,
    "work": 157,
    "home": 158,
    "life": 159,
    "love": 160,
    "great": 161,
    "small": 162,
    "big": 163,
    "long": 164,
    "old": 165,
    "young": 166,
    "man": 167,
    "woman": 168,
    "child": 169,
    "city": 170,
    "country": 171,
    "place": 172,
    "thing": 173,
    "hand": 174,
    "eye": 175,
    "face": 176,
    "head": 177,
    "door": 178,
    "book": 179,
    "line": 180,
    "point": 181,
    "part": 182,
    "end": 183,
    "start": 184,
    "right": 185,
    "left": 186,
    "down": 187,
    "back": 188,
    "again": 189,
    "still": 190,
    "never": 191,
    "always": 192,
    "every": 193,
    "many": 194,
    "most": 195,
    "same": 196,
    "even": 197,
    "much": 198,
    "own": 199,
    "him": 200,
    "us": 201,
    "them": 202,
    "me": 203,
    "come": 204,
    "go": 205,
    "take": 206,
    "give": 207,
    "put": 208,
    "find": 209,
    "tell": 210,
    "ask": 211,
    "seem": 212,
    "feel": 213,
    "try": 214,
    "leave": 215,
    "call": 216,
    "keep": 217,
    "let": 218,
    "begin": 219,
    "show": 220,
    "hear": 221,
    "play": 222,
    "run": 223,
    "move": 224,
    "live": 225,
    "stand": 226,
    "turn": 227,
    "open": 228,
    "close": 229,
    "bring": 230,
    "hold": 231,
    "look": 232,
    "use": 233,
    "set": 234,
    "change": 235,
    "build": 236,
    "become": 237,
    "need": 238,
    "want": 239,
    "help": 240,
    "Scotland": 241,
    "Edinburgh": 242,
    "Glasgow": 243,
    "Scot": 244,
    "tish": 245,
    "land": 246,
    "land": 246,
    "anti": 119,
    "antidis": 247,
    "antidisestablish": 248,
    "antidisestablishment": 249,
    "antidisestablishmentarian": 250,
    "antidisestablishmentarianism": 251,
    "\ud83c\udfb5": 252,
    "\ud83e\udd16": 253,
    "The": 254,
    "quick": 131,
    "Quick": 255,
    "Brown": 256,
    "Fox": 257,
    "def ": 258,
    "fibonacci(": 259,
    "n):": 260,
    "re": 261,
    "pre": 262,
    "inter": 263,
    "over": 264,
    "under": 265,
    "out": 266,
    "sub": 267,
    "super": 268,
    "trans": 269,
    "micro": 270,
    "macro": 271,
    "bio": 272,
    "geo": 273,
    "techno": 274,
    "logy": 275,
    "graph": 276,
    "scope": 277,
    "meter": 278,
    "phone": 279,
    "vision": 280,
    "action": 281,
    "process": 282,
    "system": 283,
    "data": 284,
    "model": 285,
    "train": 286,
    "test": 287,
    "input": 288,
    "output": 289,
    "network": 290,
    "layer": 291,
    "weight": 292,
    "loss": 293,
    "gradient": 294,
    "function": 295,
    "param": 296,
    "eter": 297,
    "algorithm": 298,
    "compute": 299
  },
  "merges": [
    ["h", "e"],
    ["he", "l"],
    ["hel", "lo"],
    ["w", "o"],
    ["wo", "r"],
    ["wor", "ld"],
    ["u", "n"],
    ["b", "r"],
    ["br", "e"],
    ["bre", "ak"],
    ["a", "b"],
    ["ab", "le"],
    ["un", "break"],
    ["unbreak", "able"],
    ["E", "d"],
    ["Ed", "in"],
    ["Edin", "burgh"],
    ["C", "h"],
    ["Ch", "at"],
    ["G", "P"],
    ["GP", "T"],
    ["Chat", "GPT"],
    ["d", "e"],
    ["de", "f"],
    ["f", "i"],
    ["fi", "b"],
    ["fib", "on"],
    ["fibon", "acci"],
    ["fibonacci", "("],
    ["fibonacci(", "n"],
    ["fibonacci(n", ")"],
    ["fibonacci(n)", ":"],
    ["T", "h"],
    ["Th", "e"],
    ["q", "u"],
    ["qu", "i"],
    ["qui", "ck"],
    ["b", "r"],
    ["br", "o"],
    ["bro", "wn"],
    ["f", "o"],
    ["fo", "x"],
    ["i", "n"],
    ["in", "g"],
    ["e", "d"],
    ["e", "r"],
    ["t", "i"],
    ["ti", "on"],
    ["n", "e"],
    ["ne", "ss"],
    ["m", "e"],
    ["me", "nt"],
    ["f", "u"],
    ["fu", "l"],
    ["l", "e"],
    ["le", "ss"],
    ["o", "u"],
    ["ou", "s"],
    ["i", "v"],
    ["iv", "e"],
    ["a", "l"],
    ["a", "n"],
    ["an", "t"],
    ["ant", "i"],
    ["d", "i"],
    ["di", "s"],
    ["dis", "establish"],
    ["establish", "ment"],
    ["antidis", "establish"],
    ["antidisestablish", "ment"],
    ["antidisestablishment", "arian"],
    ["antidisestablishmentarian", "ism"],
    ["S", "c"],
    ["Sc", "o"],
    ["Sco", "t"],
    ["Scot", "land"],
    ["G", "l"],
    ["Gl", "a"],
    ["Gla", "sg"],
    ["Glasg", "ow"]
  ],
  "special_tokens": {
    "<|endoftext|>": 50256,
    "<|startoftext|>": 50257,
    "<|pad|>": 50258,
    "<|unk|>": 50259
  },
  "info": {
    "description": "Simplified BPE vocabulary subset for educational tokenisation widget",
    "notes": "This is a pedagogical approximation, not a production tokeniser. Token IDs are illustrative. The merges list defines BPE merge rules in order of application.",
    "example_tokenisations": {
      "Hello world": ["Hello", " world"],
      "unbreakable": ["un", "break", "able"],
      "Edinburgh": ["Edin", "burgh"],
      "antidisestablishmentarianism": ["anti", "dis", "establish", "ment", "arian", "ism"],
      "ChatGPT": ["Chat", "GPT"],
      "The quick brown fox": ["The", " quick", " brown", " fox"],
      "def fibonacci(n):": ["def", " fib", "on", "acci", "(", "n", "):"]
    }
  }
}
